#+TITLE:Analysis script for online acceptability study: occupant-pedestrian dilemmas
#+LaTeX_CLASS: koma-article
#+LaTeX_CLASS_OPTIONS: [colorlinks=true,linkcolor=black]
#+LaTeX_HEADER: \usepackage[margin=0in]{geometry}
#+AUTHOR: Autonomous Vehicles Study Project 2017
-----
* Manipulation check
We first run a chi-squared test of indepdence check if our
manipulation of perspective induced greater identification with the
party.
#+BEGIN_SRC R :session *R* :results output :exports both
set.seed(123)

manip_check.sub <- subset(data, ((ratio == "1v1") & (scenario == "road")))
manip_check.sub <- droplevels(manip_check.sub)

manip_check.sub$perspective <- combineLevels(manip_check.sub$
                                             perspective, levs = c("pedestrian_fwd", "pedestrian_side"), newLabel = c("pedestrian"))

manip_check.xtab <- xtabs(~perspective + identify, data = manip_check.sub)

manip_check.chisq <- chisq.test(manip_check.xtab, simulate.p.value = TRUE)

manip_check.chisq
#+END_SRC

#+RESULTS:
: The original levels car observer pedestrian_fwd pedestrian_side
: have been replaced by car observer pedestrian
:
: 	Pearson's Chi-squared test with simulated p-value (based on 2000
: 	replicates)
:
: data:  manip_check.xtab
: X-squared = 38.115, df = NA, p-value = 0.0004998

Follow up with post-hoc comparisons:
#+BEGIN_SRC R :session *R* :results output :exports both
manip_check.post <- chisq.post.hoc(manip_check.xtab)
manip_check.post
#+END_SRC

#+RESULTS:
: Adjusted p-values used the fdr method.
:                comparison  raw.p  adj.p
: 1        car vs. observer 0.0662 0.0662
: 2      car vs. pedestrian 0.0000 0.0000
: 3 observer vs. pedestrian 0.0002 0.0002

*** compare the models
We compare the models on AIC, BIC and likelihood
#+BEGIN_SRC R :session *R* :results output :exports both
carped_cmp <- anova(carped_num.glmm, carped_fac.glmm)
print(carped_cmp)
#+END_SRC

#+RESULTS:
#+begin_example
Data: carped.sub
Models:
carped_num.glmm: response ~ ratio_c + perspective + motorist + ratio_c:perspective +
carped_num.glmm:     ratio_c:motorist + perspective:motorist + ratio_c:perspective:motorist +
carped_num.glmm:     (1 | participant)
carped_fac.glmm: response ~ ratio_f + perspective + motorist + ratio_f:perspective +
carped_fac.glmm:     ratio_f:motorist + perspective:motorist + ratio_f:perspective:motorist +
carped_fac.glmm:     (1 | participant)
                Df    AIC    BIC  logLik deviance  Chisq Chi Df Pr(>Chisq)
carped_num.glmm 13 570.75 628.17 -272.38   544.75
carped_fac.glmm 25 581.13 691.55 -265.56   531.13 13.625     12     0.3253
#+end_example

